const src = `ДОГОВОР
Днес - 01.04.2017 год. В гр.Пловдив  се сключи настоящият договор между, МОНИ МГ ООД с адрес на управление  гр.Пловдив, ул.Шумен 2, ЕИК БУЛСТАТ 115780125, представлявано от Георги Райков, наричано за краткост по-долу ВЪЗЛОЖИТЕЛ от една страна, и ПУЛПУДЕВА ИНВЕСТ ЕООД с адрес на управление гр.Пловдив бул.А.Стамболийски 29, ЕИК БУЛСТАТ 201365210, представлявано от Петър Герчев , наричано за краткост по-долу ИЗПЪЛНИТЕЛ , от друга страна.
Договорът се сключва на основание чл.280 от ЗЗД, в съответствие с чл.24, ал.3 от Закона за здравословни и безопасни условия на труд, съгласно изискванията на Наредба  N3 от 1998 год. за функциите и задачите на длъжностните лица и на специализираните служби в предприятията за организиране изпълнението на дейностите, свързани със защитата и профилактиката на професионалните рискове, и съобразно притежаваната квалификация
и правоспособност на ИЗПЪЛНИТЕЛЯ.
СТРАНИТЕ СЕ СПОРАЗУМЯХА ЗА СЛЕДНОТО,
Чл.1 .ВЪЗЛОЖИТЕЛЯТ възлага, а ИЗПЪЛНИТЕЛЯТ приема да изпълнява функциите на длъжностното лице по безопасност и здраве при работа в МОНИ МГ ООД, считано от 01.04.2017 г.
Чл.2.ВЪЗЛОЖИТЕЛЯТ се задължава да осигурява необходимата информация и условия
за ефективното изпълнение на задачите на ИЗПЪЛНИТЕЛЯ, да осигури достъп до необходимата
документация и до обектите на фирмата.
Чл.3.При  необходимост от командироване на ИЗПЪЛНИТЕЛЯ, ВЪЗЛОЖИТЕЛЯТ осигурява за
своя сметка служебен транспорт, съгласно Наредбата за командировките в страната/
Чл.4.ВЪЗЛОЖИТЕЛЯТ се задължава да изплаща на ИЗПЪЛНИТЕЛЯ месечно възнаграждение
в размер на  450 лева/Четиристотин и петдесет  лева/ без ДДС, като плащането ще се извършва
по банков път и по сметка…………………………………………………….при ПИРЕОС БАНК срещу фактура до
5 /пето/ число на следващия месец, придружена с протокол, подписан от двете страни, в който
са описани дейностите и изготвените документи, предмет на договора за изтеклия месец.
Чл.5.ИЗПЪЛНИТЕЛЯТ приема да осъществява взаимодействие със службите за пожарна безопасност и защита на населението, Гражданска защита и Дирекция Инспекция по труда,
Като представлява фирмата пред съответните контролни органи.`


let outcome = src.replace(/  /, '')
outcome = src.replace(/\./, '')

console.log(outcome.length, src.length)
